# 4-5.pandas - Dataframe operations

## Series operation

In [1]:
import pandas as pd
import numpy as np

In [9]:
s1 = pd.Series(
    range(1,6), index=list("abced")
)
s1

a    1
b    2
c    3
e    4
d    5
dtype: int64

In [11]:
s2 = pd.Series(
    range(5,11), index=list("bcedef")
)
s2

b     5
c     6
e     7
d     8
e     9
f    10
dtype: int64

In [12]:
s1 + s2

a     NaN
b     7.0
c     9.0
d    13.0
e    11.0
e    13.0
f     NaN
dtype: float64

In [13]:
s1.add(s2)

a     NaN
b     7.0
c     9.0
d    13.0
e    11.0
e    13.0
f     NaN
dtype: float64

In [14]:
s1.add(s2, fill_value=0)

a     1.0
b     7.0
c     9.0
d    13.0
e    11.0
e    13.0
f    10.0
dtype: float64

## dataframe operation

In [15]:
df1 = pd.DataFrame(
    np.arange(9).reshape(3,3),
    columns=list("abc")
)
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [16]:
df2 = pd.DataFrame(
    np.arange(16).reshape(4,4),
    columns=list("abcd")
)
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [17]:
df1 + df2

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [18]:
df1.add(df2)

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [19]:
df1.add(df2, fill_value=0)

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

## Series + Dataframe

In [20]:
df = pd.DataFrame(
    np.arange(16).reshape(4,4),
    columns=list("abcd")
)
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [21]:
s = pd.Series(
    np.arange(10,14),
    index=list("abcd")
)
s

a    10
b    11
c    12
d    13
dtype: int32

In [22]:
df + s

    a   b   c   d
0  10  12  14  16
1  14  16  18  20
2  18  20  22  24
3  22  24  26  28

In [24]:
s2 = pd.Series(np.arange(10,14))
s2

0    10
1    11
2    12
3    13
dtype: int32